#จะพูดถึง library Regular Expression

import re

#   . คือตัวอักษรหรือสัญลักษณฺ์อะไรก็ได้ รวมถึงช่องว่าง
#   \s เว้นวรรคหนึ่งตัว
#   \S ไม้นับช่องว่างตัวอักษรเลขเหี้ยอะไรก็ได้
#   * คือเอาตัวอักษรนั้นหรือไม่เอาก็ได้ (แม้จะซ้ำก็ใช้ได้) เช่น  py* มันจะดูว่าหลัง p มี y หรือไม่มีก็ได้ python , pyyyyy , p 
#   + ใช้เหมือน * แต่จะจ้องมีตัวอักษร สามารถซ้ำกันได้ py+ มันจะดูว่าหลัง p ต้องมี y  python , pyyyyy  
#   [] เป็นช่วงวิเศษสามารถกำหนดได้ว่าเอาอะไรบ้างในนี้ มีค่าเป็น 1 ตัวเลขเท่านั้นต่อช่อง [Pp]y แปลว่าเอาเป็น p หรือ P ได้หมดก่อน y และสามารถทำได้มากกว่านั้น [a-z0-9 \.]
#   \ คือใช้กับเครื่องหมายหรือสัญลักษณ์ใช้ก่อน \. \d แต่ต้องใช้ r""หน้าคำ

#ตัวอย่าง
print(re.findall(r'[a-zA-Z0-9_]+@gmail.com', 'darunpoppong@gmail.com @gmail.com daSFF455@gmail.com'))

# [a-zA-Z0-9-_] คือเอา a-z เล็ก A-Z ใหญ่ เอา 0 ถึง 9 หรือ - หรือ _ จำนวนกี่ตัวก็ได้(+)และต้องต่อด้วย @gmail.com

# \d{3} หมายถึงตัวเลข 3 ตัวต่อมา-

