# point or line is clearly not convex, return

# firstTurn = ccw(P[0], P[1], P[2])

# for (i = 1; i < sz-1; ++i)

#   tmp = (i+2 == sz ? 1: i+2)

#   if ccw(P[i], P[i+1], P[tmp]) != firstTurn

#     return polygon is not convex

# return polygon is convex

# หลักการคือ
# 1.มุมภายในทุกมุมต้องไม่เกิน 180 องศา
# หรือก็คือ มุมด้านในของรูปหลายเหลี่ยมทุกมุมต้องไม่หักกลับเข้าด้านใน

# 2.เส้นตรงที่เชื่อมจุดใดๆ สองจุดในรูปหลายเหลี่ยม จะต้องอยู่ภายในรูปหลายเหลี่ยมเสมอ
# ตัวอย่างเช่น หากลากเส้นตรงจากจุด A ไปยังจุด B (ซึ่งเป็นจุดใดๆ ในรูปหลายเหลี่ยม) เส้นนั้นจะไม่ตัดขอบหรือหลุดออกจากรูปหลายเหลี่ยม

# https://visualgo.net/en/polygon